---
title: Руководство по обновлению pfSense с помощью команд оболочки и Яндекс-браузера
date: "2025-05-13 10:19:19 +0100"
id: pfsense-update-gui-cli
lang: ru
layout: single
author_profile: true
categories:
  - FreeBSD
tags: "SysAdmin"
excerpt: Каждый процесс обновления, выполняемый pfSense, включает в себя версию, которую он выпустил
keywords: pfsense, update, freebsd, gui, shell, upgrade, command, line, browser, yandex
---

Каждое созданное приложение обязательно будет обновляться. Это показывает, что приложение широко используется и полезно для многих людей. Аналогичным образом, pfSense, одно из приложений для маршрутизаторов и брандмауэров с самым большим сообществом, почти каждый год обновляется, иногда даже выпуская последнюю версию. Разработчики постоянно внедряют инновации, превращая pfSense в стабильный и надежный маршрутизатор.

Каждый процесс обновления, выполняемый pfSense, включает в себя версию, которую он выпускает. Он направлен на обновление приложений и их зависимостей до последних версий, чтобы многие пользователи могли ощутить преимущества системы. Процесс обновления позволяет нам убедиться в том, что разработчики активно следят за использованием pfSense.

pfSense, которая является частью продукта Netgate, периодически и на постоянной основе выпускает последние версии, содержащие новые функции, обновления, исправления ошибок и различные другие изменения. В некоторых случаях процесс обновления pfSense очень важен, поскольку он полностью устраняет недостатки функций последних версий, выпущенных Netgate. pfSense всегда выполняет обновления, используя ту же версию программного обеспечения, что и брандмауэр-маршрутизатор, который вы используете в данный момент.

Процесс обновления pfSense также направлен на то, чтобы не отставать от своего старшего собрата FreeBSD, который продолжает выпускать свои последние версии. На момент написания этой статьи FreeBSD достигла версии 14. 

Учитывая важность процесса обновления pfSense, в этом посте мы немного расскажем о том, как обновить pfSense с версии 2.5.2-RELEASE (amd64) до версии 2.7.0-RELEASE (amd64). Написание этой статьи основано на опыте автора по использованию pfSense для бизнес-точек доступа WI-Fi.

По умолчанию маршрутизаторы pfSense распознают два метода обновления, а именно:
1. Обновление через графический интерфейс пользователя (веб-браузер) и
2. Обновление через командную строку (shell).

## 1. Обновитесь с помощью Яндекс браузера

Процесс обновления с помощью графического интерфейса пользователя (веб-браузера) очень прост, потому что вы просто запускаете команду, щелкнув меню обновления. Чтобы выполнить первое обновление, вы можете сделать это в режиме просмотра pfSense dasboard, см. изображение ниже.

![Dashboard PFSense](https://gitflic.ru/project/iwanse1212/upravlenie-polosoi-propuskaniya-pfsense-qos/blob/raw?file=Dashboard%20PFSense.jpg&commit=a9a35e385c2a134a0bb7341340d1761d04806476)

На картинке выше, обратите внимание на надпись зеленым цветом, вы просто нажимаете на круглую стрелку, после чего процесс обновления запустится автоматически.

Процесс обновления с графическим интерфейсом происходит очень быстро, всего за несколько минут вы успешно обновили pfSense.

Другой способ, который вы можете сделать, - это выбрать системное меню ->> Обновить. Рассмотрим следующий пример на картинке.

![system Update PFSense](https://gitflic.ru/project/iwanse1212/upravlenie-polosoi-propuskaniya-pfsense-qos/blob/raw?file=System%20Update%20PFSense.jpg&commit=f7e30bc33eb6d47437384021e185fd872a4da278)


<br/><br/>

### Поддерживать
Если вы считаете, что моя статья ценна и полезна для вас. Пожалуйста, рассмотрите возможность сделать пожертвование.

Ваше пожертвование очень ценно для написания следующих статей более высокого качества.

#### Спасибо.

##### Payeer: P1052173944
##### Paypal: datainchi@gmail.com
##### Faucetpay: datainchi@gmail.com
##### Bitcoin Payeer: 32RW6hDPRA5bNtcHS4HQX8S4FSGsEvmJ9T
##### Bitcoin Faucetpay: 1QPJFAXtrLZWJLi9PPTeYXVEZKwydXQoY
<br/><br/>

## 2. Обновление с помощью Shel / команд командной строки

Процесс обновления с помощью командной строки требует специальных навыков, таких как освоение команд оболочки FreeBSD, понимание концепции пакетов PKG и системных портов. Для тех из вас, кто не знаком с командами командной строки, рекомендуется обновить pfSense с помощью графического интерфейса пользователя.

В процессе обновления с помощью командной строки вы должны включить SSH, чтобы иметь возможность войти в систему pfSense. После успешного включения SSH, если вы используете компьютер с Windows, вы можете запустить Putty.

В меню Putty введите свой IP-адрес, имя пользователя pfSense и пароль. После успешного входа в систему введите число 13, чтобы начать обновление pfSense с помощью командной строки, см. пример ниже.

![Update from console](https://gitflic.ru/project/iwanse1212/upravlenie-polosoi-propuskaniya-pfsense-qos/blob/raw?file=Update%20from%20Console.jpg&commit=f6162cc979489119185f6e8990f217f61b37d6a1)

Помимо обновления pfSense описанным выше способом, есть еще один способ обновить pfSense, а именно с помощью команд оболочки. Это лучший способ, и мы настоятельно рекомендуем его. Поскольку в процессе обновления используются пакеты PKG, которые есть во FreeBSD.

В меню Putty или Remmina, если вы используете Ubuntu Desktop, выберите цифру 8, и вам сразу же будет показана команда оболочки pfSense.

Поскольку в процессе обновления используются пакеты PKG, процесс обновления практически такой же, как во FreeBSD. Выполните следующую команду, чтобы запустить процесс обновления.

```
[2.7.0-RELEASE][root@ns5.kursor.my.id]/root: pkg update -f
```
После этого вы продолжите процесс обновления. Выполните приведенную ниже команду, чтобы запустить процесс обновления pfSense.

```
[2.7.0-RELEASE][root@ns5.kursor.my.id]/root: pkg upgrade -f
```

Описанный выше способ заключается в том, как обновить pfSense, обновив пакет FreeBSD PKG. Есть и другой способ обновления, а именно с помощью команды "pfSense-upgrade", рассмотрим пример использования этой команды.

```
[2.7.0-RELEASE][root@ns5.kursor.my.id]/root: pfSense-upgrade -d -f -u -c
>>> Updating repositories metadata... 
Updating pfSense-core repository catalogue...
Fetching meta.conf: . done
Fetching packagesite.pkg: . done
Processing entries: . done
pfSense-core repository update completed. 4 packages processed.
Updating pfSense repository catalogue...
Fetching meta.conf: . done
Fetching packagesite.pkg: ......... done
Processing entries: .......... done
pfSense repository update completed. 550 packages processed.
All repositories are up to date.
```

## 3. Обновление пакетов pfSense
Как и во FreeBSD, в pfSense также есть пакет прикладных программ, которые могут быть установлены в систему pfSense. Разработчиками каждый пакет pfSense был модифицирован таким образом, чтобы его можно было запускать только в системах pfSense.

Чтобы выполнить обновление пакета pfsense, вы можете воспользоваться командой "pfSense-upgrade". В приведенном ниже примере мы покажем вам, как установить прокси-пакет Squid.

```
[2.7.0-RELEASE][root@ns5.kursor.my.id]/root: pfSense-upgrade -i squid
```

Если вы хотите удалить прокси-пакет squid из pfSense, выполните приведенную ниже команду.

```
[2.7.0-RELEASE][root@ns5.kursor.my.id]/root: pfSense-upgrade -r squid
```

Перед установкой пакета pfSense возьмите за правило сначала запускать команду обновления. Это необходимо для того, чтобы убедиться, что вы получите последнюю версию пакета pfSense для установки.

Если вы регулярно используете pfSense, процесс обновления системы pfSense следует выполнять регулярно. Это делается для того, чтобы система и ее пакеты приложений находились в самом современном состоянии.
